{
  "id": 5,
  "callLetters": "KIZN",
  "frequency": "92.3 FM",
  "location": "Boise, Idaho",
  "format": "Country Music",
  "stationName": "KIZN \"Kissin' 92.3\"",
  "established": "1967",
  "synopsis": "KIZN 92.3 FM, branded as \"Kissin' 92.3,\" stands as Boise's premier country music destination and one of the market's most enduring format successes.",
  "fullContent": "KIZN 92.3 FM: Boise's Country Music Evolution\n\nKIZN 92.3 FM, branded as \"Kissin' 92.3,\" stands as Boise's premier country music destination and one of the market's most enduring format successes. From its humble beginnings as KATN-FM in December 1967 to its transformation into Idaho's leading country station, KIZN represents nearly six decades of Treasure Valley broadcasting evolution.\n\nThe station's journey through multiple format changes—from its early days through the Magic 92 Top 40 era to 92 Kiss FM and finally to its country music identity in 1990—mirrors the broader changes in American radio and the rise of country music as a dominant cultural force. Under Cumulus Media ownership, KIZN has established itself as a \"Big Market\" country station, consistently ranking in the Top 5 across nearly every demographic while maintaining its family-friendly programming philosophy.\n\nBroadcasting History and Format Evolution\n\nKIZN's broadcasting history began in December 1967 when the station launched as KATN-FM, entering the airwaves during the early expansion of FM radio in smaller western markets. The first significant format change occurred on August 1, 1968, when the station adopted the call letters KBBK.\n\nThe most transformative moment came on January 2, 1978, when KBBK flipped to a new Top 40 format branded as Magic 92, becoming \"one of the first full-time FM Top 40 stations in the Boise market.\" In 1984, the station underwent another transformation, changing call letters to KIYS and rebranding as 92 Kiss FM, reflecting the evolution into Contemporary Hit Radio (CHR) format.\n\nThe most significant moment in the station's history occurred in 1990 when management made the strategic decision to switch to a Country format as Kissin' 92 and adopt the call letters KIZN. The format switch created immediate competitive dynamics, as \"the switch left Boise with just one CHR station (KF95) until KZMG re-launched as Magic 93.1 in 1991.\"\n\nCumulus Media Ownership and Operations\n\nKIZN operates under Cumulus Media ownership through Radio License Holding CBC, LLC, as part of a six-station cluster that includes KBOI 93.1FM/670AM (News/Talk), 96.9 The Eagle/KKGL-FM (Classic Rock), 95.3FM The Ticket/KTIK-FM (Sports), and Magic 97.9FM/KQFC-FM (AC).\n\nNancy Wirth serves as Director of Sales for the Cumulus Boise radio group, appointed in March 2022 as a \"23-year veteran of radio and television sales and marketing.\" The corporate structure provides technical and engineering support that ensures reliable operations and maintains professional broadcasting standards.\n\nCurrent Programming and Personalities\n\nThe morning show (5AM-10AM) currently features Connor and Chris, described as \"the dynamic duo who are ready to kick-start your day.\" Bret Connor brings local credibility as a \"Boise native\" who \"was showcasing his basketball skills on the Boise State court\" during his college years.\n\nAlana Lynn hosts middays, bringing experience as \"former KMLE Phoenix MD/morning co-host\" and \"co-hosting mornings in the Boise market at '104.3 Wow Country' KAWO.\" Steve handles afternoons (3pm-7pm), with a radio career that \"started at KLZR in 1981 while he was attending the University of Kansas in Lawrence.\"\n\nEvening programming features \"NASH Nights Live With Shawn and Elaina,\" representing the station's affiliation with the NASH brand and providing access to nationally syndicated programming.\n\nNASH Affiliation and National Connections\n\nKIZN's status as an \"official NASH affiliate\" provides significant programming and promotional advantages, offering \"interviews with Country's biggest stars\" and access to exclusive content. The NASH affiliation enables KIZN to participate in national country music promotional campaigns and secure artist interviews.\n\nElaina represents a significant NASH programming asset, described as having \"become one of the strongest female presences in Country Radio, having hosted shows in San Diego, Florida, and on over 100 stations simultaneously on NASH Nights Live.\"\n\nCommunity Engagement and Promotional Activities\n\nKIZN actively promotes itself as \"very active with local promotions and giveaway contests.\" Major promotional activities include concert sponsorships like \"Jacksons Country Stomp\" with \"2 for 1 deal on Pit Passes\" and appearances by major artists like \"Chris Janson\" at the \"Western Idaho Fair.\"\n\nThe station maintains 26,754 likes on Facebook and emphasizes its family-friendly approach, operating as \"A family station with no blue or questionable content or music.\" KIZN broadcasts from 1419 W Bannock St, Boise, ID, 83702.\n\nTechnical Operations and Digital Presence\n\nThe station's commitment to modern operations includes \"The All New KISSIN 92.3 APP\" featuring \"Push Notifications for News, Weather, Traffic & Contests\" and \"Wake up with our Alarm Clock\" functionality. The technical infrastructure supports \"live and local ALL DAY\" programming.\n\nMarket Performance and Competitive Position\n\nKIZN promotes itself as \"Boise's 'Big Market' Country station\" and claims status as \"the top rated radio country station in the Boise market with Adults 25-54.\" The station describes itself as \"the most consistent radio performer in the market, consistently ranking in the Top 5 for nearly every demographic.\"\n\nRecent Staff Changes and Programming Evolution\n\nOctober 2019 marked significant transitions when Chris Matthews was appointed as \"Program Director and Morning co-Host.\" Matthews brought extensive experience as a \"17-year radio broadcasting professional\" who was \"previously Program Director and Afternoon Drive Host for iHeartMedia station KBEB-FM in Sacramento, CA.\"\n\nThe Matthews appointment created a new morning team pairing him with Alana Lynn, who moved from middays to mornings, reflecting management's confidence in both personalities for the crucial morning daypart."
}