{
  "id": "kfxd",
  "name": "KFXD - Super 58",
  "frequency": "580 AM",
  "location": "Nampa/Boise, Idaho",
  "format": "Talk",
  "established": "Various",
  "synopsis": "KFXD-AM represents one of the most complex and fascinating broadcasting legacies in American radio history, with roots that stretch back over a century to the experimental days of wireless communication. The station's call letters originated in 1925 ...",
  "fullProfile": "",
  "fullContent": "KFXD-AM: A Century of Radio Evolution - The Complete History of Idaho's Pioneer Broadcasting Voice\n\nIntroduction\nKFXD-AM represents one of the most complex and fascinating broadcasting legacies in American radio history, with roots that stretch back over a century to the experimental days of wireless communication. The station's call letters originated in 1925 in Logan, Utah, before moving to Jerome, Idaho in 1927, and finally settling in Nampa, Idaho in 1930 WikipediaWikipedia, where it would become a cornerstone of Idaho broadcasting for the next nine decades.\n\nThe KFXD story is actually two intertwining narratives: the physical facility that today broadcasts on 630 AM, and the intellectual property of the KFXD call letters themselves. On August 14, 2002, in one of radio's most unusual transactions, stations KIDO and KFXD exchanged call signs, with the facility at 580 AM becoming KIDO and the facility at 630 AM becoming KFXD Wikipedia. This swap created a unique situation where the FCC traces the \"new\" KFXD as operating under the same license as the \"old\" KIDO, while the intellectual unit that began as KFXD in 1925 now resides at 580 AM as KIDO Wikipedia.\nCurrently owned by Townsquare Media and branded as \"Power 105.5,\" KFXD operates as a rhythmic contemporary station on 630 AM with a low-powered FM translator at 105.5 Wikipedia. The station broadcasts at 5,000 watts during the day but must reduce power to an all-but-unlistenable 37 watts at night to protect other stations on adjacent channels Wikipedia, a technical limitation that has shaped its programming strategy for decades.\n\nPart I: The Utah Genesis (1925-1927)\nKFXD's first license was granted on September 2, 1925, with sequentially assigned call letters to L.H. Strong of Packard Motor Co. in Logan, Utah, transmitting on 1460 kHz Wikipedia. The station represented the early experimental phase of commercial broadcasting, when automobile dealerships, department stores, and other businesses invested in radio as a novel form of advertising and community engagement.\nIn early 1926, station ownership was transferred to the Service Radio Corporation, still operating in Logan Wikipedia. This brief Utah period established KFXD as one of the early commercial radio ventures in the Mountain West, though its true destiny lay across the state line in Idaho.\n\nPart II: The Jerome Experiment (1927-1930)\nThe transformation of KFXD from Utah experiment to Idaho institution began when Frank Hurt purchased KFXD in 1926 and moved it to Jerome, Idaho Idaho Press. In early 1927, after allowing the license to lapse briefly, KFXD was relicensed to Service Radio in Jerome, broadcasting on 1470 kHz Wikipedia.\nThe Idaho Statesman reported on December 18, 1926 that \"The machine was installed in Jerome, and during the forepart of the week a test trial proved it to be satisfactory\" Idaho Press. This period in Jerome served as a crucial testing ground for what would become one of Idaho's most enduring broadcasting operations.\n\nPart III: The Nampa Era Begins (1930-1940s)\nThe Move to Nampa\nA potentially larger listening audience convinced Hurt to move the station to Nampa in 1930 Idaho Press. The relocation represented a strategic decision to serve the growing Treasure Valley market, positioning KFXD between the agricultural communities of Canyon County and the urban center of Boise.\nThe Boise paper described the new studios: \"The new station, an attractive, well arranged white stucco building of Spanish type, is located at 1024 Twelfth avenue south\" Idaho Press. This Spanish-style building would become an architectural landmark in Nampa and is now owned by the History of Idaho Broadcasting Foundation, with plans to convert it into the Idaho Broadcasting History & Education Center Historyofidahobroadcasting.\nEarly Programming\n\nThe station went on the air in Nampa in May 1930 with a live performance by Mrs. Fred Rosene, a prominent Boise soloist Idaho Press. This inaugural broadcast established KFXD's commitment to live, local programming that would characterize its golden years.\nDuring the 1940s, KFXD developed a diverse programming schedule that reflected the interests of its rural and urban audience. In 1940, listeners could hear the \"highly amusing\" broadcast of a drama called \"Cub Reporters,\" the early morning program \"Musical Clock,\" and the afternoon program \"Highlights of History,\" brought to you by Lloyd Lumber Company Idaho Press.\n\nTechnical Evolution\nThe Owyhee Plaza Hotel in downtown Boise housed KFXD's Boise studios in the 1930s and 1940s allowing the station to maintain a presence in both Nampa and Boise. This dual-city operation demonstrated KFXD's ambition to serve the entire Treasure Valley market.\nThe towers that would become synonymous with KFXD were erected in 1946 at the Amity Road site in Meridian Kivitv. The facility was extraordinary, complete with a public park with picnic tables Kivitv, reflecting the era when radio stations were community gathering places as much as broadcasting facilities.\n\nPart IV: Television Ventures and the KFXD-TV Experiment (1953)\nIdaho's First Television Station\nOne of the most remarkable chapters in KFXD's history was its brief foray into television broadcasting. KFXD-TV was the first television station in the state of Idaho, broadcasting for less than two months in the summer of 1953, between June 18 and August 11 Wikipedia.\nThe first television test pattern in Idaho made it onto screens as far away as Weiser and Ontario, Oregon, on June 18, with lieutenant governor Edson Deal helping put the station on the air. Commercial programming followed 11 days later, on June 29 Wikipedia.\n\nThe Fence Antenna\nThe station used a temporary antenna setup that was unusual - instead of a tower, the transmitter elements were mounted on a large redwood fence facing the Boise Valley Wikipedia. This makeshift arrangement symbolized both the experimental nature of early television and KFXD's pioneering spirit.\n\nWhy Television Failed\nThe television venture failed for several interconnected reasons. Though it was announced shortly before signing on that KFXD-TV would be an ABC affiliate, no such hookup ever materialized Wikipedia. Station president Edward P. Hurt discovered fundamental incompatibilities between radio and television operations.\nHurt discovered that while radio stations kept $95 of every $100 in advertising, in television all the money went to \"some New York film company\" Wikipedia. The station was relegated to a two-man operation run by Hurt and chief engineer Gilbert Rose, airing only \"30 year-old movies\" for two hours a day, and on some nights, only a test pattern Wikipedia.\nOn August 11, 1953, with KIDO-TV having launched successfully on July 12 as a full-service NBC affiliate, Hurt gave up after less than two months of trying Wikipedia. In closing down, KFXD-TV was just the second television station in the entire United States, and the first on VHF, to cease operating Wikipedia.\n\nPart V: The Golden Years of Radio (1950s-1970s)\nThe Classic Era\nBy the mid-1950s, KFXD had settled into its identity as a full-service radio station serving the Treasure Valley. In the mid-'50s listeners could tune in to the Eddy Arnold Show, right before the farm report, and in the evening catch a high school football game between Nampa and Jerome Idaho Press.\n\nNotable Personalities of the 1960s\nThe 1960s marked a period of significant growth and personality-driven programming. In 1966, listeners might have heard Ezra Taft Benson give an address to the BYU student body on \"Our Immediate Responsibilities\" Idaho Press.\n\nIn 1969, the station featured the Jay Eubanks Show, including farm programming until seven, followed by a talk show with Wayne Cornils, and popular music with Dave Ferdinand, Paul King, Don Campbell, and Tom Scott Idaho Press.\nJay Eubanks: A Broadcasting Legend\nJay Eubanks began his broadcast career in 1955 doing a music show alongside Jim Hillyard on KFXD in Nampa while in high school Cache Valley Daily. He served as Program Director at KFXD from 1964-1969, working with \"Radio\" Wayne Cornils and hosting a talk show with him Cache Valley Daily. Eubanks would go on to become a three-time Idaho Sportscaster of the Year and a fixture in Idaho broadcasting for 56 years.\nT\nhe Rock and Roll Revolution\nOn January 1, 1970, KFXD went full-time rock and roll Idaho Press, marking a dramatic format shift that reflected changing musical tastes and demographics in the Treasure Valley.\n\nThe Paul Revere Connection\nOne of KFXD's most significant moments in music history occurred in 1971. Paul Revere dropped by the studio and asked Tom Scott to play a song called \"Indian Reservation.\" That was the first time it was heard over the air. The song went platinum, becoming Paul Revere and the Raiders' only million-selling record Idaho Press.\n\nTom Scott's Legacy\nLong-time local broadcaster Tom Scott, who was just out of high school, has fond memories of working at the station. When asked about the first record he played as a disc jockey, he said, \"Oh yeah, The Doors, 'Light my Fire.' I had planned that my first night on the air that it was going to be The Doors, and the long version of 'Light My Fire'\" \n\nCommunity Engagement\nIn 1973, the KFXD No-Stars, consisting of KFXD disc jockeys and some BSC football players, played benefit games for high schools, raising approximately $3,000 for different schools Newspapers.com. This community involvement exemplified KFXD's role as more than just a broadcasting outlet.\n\nPart VI: The Great Call Sign Swap (2002)\nThe Historic Exchange\nOn August 14, 2002, stations KIDO and KFXD exchanged call signs, with AM 580 becoming KIDO and AM 630 becoming KFXD WikipediaWikipedia. This unprecedented swap was engineered to move KIDO's news/talk format to the stronger 580 AM signal, while KFXD's call letters, classic country format and staff moved to 630 WikipediaWikipedia.\n\nTechnical Rationale\nWhile both stations operate at 5,000 watts, 580's location near the bottom of the AM dial allows its signal to travel farther. Additionally, while 580 operates at 5,000 watts around the clock, 630 had long been required to reduce power to 37 watts at night to protect several stations on adjacent channels WikipediaWikipedia.\n\nFCC Perspective\nThe FCC generally traces station identities by individual facilities rather than call signs. In this case, the \"new\" KFXD operates under the same license previously issued to the \"old\" KIDO WikipediaWikipedia. This technical distinction meant that while the public knew KFXD by its familiar call letters on a new frequency, the actual broadcasting license traced back to the original KIDO facility.\n\nPart VII: Format Evolution in the 21st Century\nClassic Country Era (2002-2007)\nFollowing the call sign swap, KFXD continued with a classic country format until July 2, 2007 Wikipedia, maintaining its connection to the agricultural heritage of the Treasure Valley.\nTalk Radio Phase (2007-2008)\n\nOn July 2, 2007, KFXD switched to \"All Talk 63 KFXD\" Wikipedia. However, this format proved short-lived. On October 15, 2008, KFXD's talk radio lineup was absorbed by sister station KIDO as the two stations began to simulcast Wikipedia.\n\nSports Broadcasting (2011-2020)\nIn October 2011, KFXD changed its format to sports, branded as \"630 The Fan\" Wikipedia. The station attempted to establish itself as a sports voice in the market, but later lost the rights to broadcast Boise State Broncos athletics to rival AM station 670 KBOI Wikipedia.\n\nThe Rhythmic Contemporary Era (2020-Present)\nOn October 23, 2020, KFXD dropped its sports format and began stunting with songs containing \"change\" in their titles, jokingly branded as \"105.5 Darrell FM,\" a reference aimed at crosstown competitor Iliad Media Group's CEO, Darrell Calton Wikipedia.\n\nAt noon on October 26, 2020, KFXD flipped to rhythmic contemporary, branded as \"Power 105.5\" Wikipedia. This format represents the station's latest reinvention, targeting a younger, urban demographic dramatically different from its traditional audience.\nPart VIII: Ownership Evolution\nClear Channel Era (1990s-2007)\n\nOn November 16, 2006, Clear Channel Communications planned to sell 448 of its radio stations outside the top 100 markets including KFXD, along with Boise sister stations KSAS-FM, KCIX, KTMY (now KAWO), KXLT-FM and KIDO WikipediaWikipedia.\n\nPeak Broadcasting Period (2007-2013)\nIn March 2007, Peak Broadcasting LLC bought the Boise stations WikipediaWikipedia. The Peak era saw multiple format changes as the company sought to find a sustainable niche for the signal-challenged 630 frequency.\n\nTownsquare Media (2013-Present)\nOn August 30, 2013, it was announced that Townsquare Media would purchase Peak Broadcasting's stations, including KFXD. The sale to Townsquare was completed on November 14, 2013 Wikipedia. Under Townsquare's ownership, KFXD has continued to evolve, ultimately landing on its current rhythmic contemporary format.\nPart IX: Technical Facilities and Infrastructure\n\nThe Historic Nampa Building\nThe Foundation currently owns the former KFXD radio building located at 1024 12th Ave. South in Nampa, built in 1938 in a beautiful \"art-deco\" style Historyofidahobroadcasting. The History of Idaho Broadcasting Foundation agreed to purchase the building and plans the Idaho Broadcasting History & Education Center BoiseDev.\n\nThe Amity Road Towers\nThe towers on Amity Road in Meridian, erected in 1946, became part of the Treasure Valley landscape for decades before being demolished Kivitv. These towers symbolized KFXD's presence in the community for over 70 years.\n\nCurrent Facilities\nToday, KFXD operates from Townsquare Media's consolidated facilities at 827 East Park Blvd. in Boise, sharing space with sister stations. The transmitter for 630 AM remains at the historic site on West Amity Road in Meridian, continuing to broadcast from the location established decades ago.\n\nPart X: The FM Translator Solution\nAddressing Signal Limitations\nThe addition of FM translator K288HG at 105.5 FM represents KFXD's solution to its longstanding nighttime signal problem. The FM translator serves mainly to fill in gaps in the nighttime signal Wikipedia, allowing the station to maintain listenership after dark when the AM signal becomes virtually unusable.\n\nBrand Identity\nThe station's current branding as \"Power 105.5\" emphasizes the FM frequency rather than the heritage AM 630, reflecting the reality that most contemporary listeners access the station via FM rather than AM.\n\nPart XI: Cultural Impact and Legacy\nPioneer Broadcasting\nKFXD's role in Idaho broadcasting history extends far beyond its daily programming. The station pioneered radio in the Treasure Valley, experimented with television when the medium was new, and adapted to every major shift in broadcasting technology and taste.\n\nMusic History\nThe station's role in breaking \"Indian Reservation\" for Paul Revere and the Raiders demonstrates KFXD's influence on popular music. Throughout the rock era of the 1970s, KFXD served as a tastemaker for young listeners in the Treasure Valley.\n\nCommunity Institution\nFrom hosting benefit basketball games with the KFXD No-Stars to providing a park at its transmitter site, KFXD embodied the community service ethos of local broadcasting. The station's Spanish-style building in Nampa remains a physical reminder of radio's golden age.\n\nPreservation Efforts\nThe History of Idaho Broadcasting Foundation's purchase of the former KFXD building and plans to create a broadcasting museum ensure that the station's physical legacy will be preserved Historyofidahobroadcasting. This museum will serve as a testament to not just KFXD, but to the entire history of Idaho broadcasting.\n\nPart XII: The Digital Age Challenges\nAM Radio's Decline\nKFXD's evolution mirrors the broader challenges facing AM radio in the 21st century. The station's nighttime power reduction to 37 watts exemplifies the technical limitations that have made AM increasingly uncompetitive in modern markets.\n\nFormat Fragmentation\nThe station's journey through classic country, talk, sports, and rhythmic contemporary formats in just two decades reflects the difficulty of finding sustainable programming for AM stations in the digital age.\n\nStreaming and Digital Presence\nLike many heritage AM stations, KFXD has embraced digital streaming to overcome signal limitations. The station streams online at powerboise.com, reaching listeners far beyond the limitations of its terrestrial signal.\n\nPart XIII: Notable Personalities Through the Decades\n\nThe Pioneers (1930s-1950s)\nFrank Hurt: The visionary who brought KFXD to Idaho\nEdward P. Hurt: Led the ambitious but failed television experiment\n\nThe Golden Age (1960s-1970s)\nJay Eubanks: Program Director who shaped KFXD's sound\nWayne Cornils: Talk show host and editorialist\nTom Scott: The young DJ who premiered \"Indian Reservation\"\nDave Ferdinand, Paul King, Don Campbell: The voices of KFXD's rock era\n\nProgram Evolution\nThe station's personality roster reflects its format changes:\n\nFarm reporters and country music DJs in the agricultural years\nRock jocks during the 1970s youth revolution\nTalk hosts during the news/talk experiments\nSports broadcasters during the \"630 The Fan\" era\nContemporary urban personalities in the current \"Power 105.5\" format\n\nPart XIV: Awards and Recognition\nWhile specific awards for KFXD are not extensively documented, the station's contributions to Idaho broadcasting have been recognized through:\n\nThe History of Idaho Broadcasting Foundation's preservation of the original building\nIndividual personalities like Jay Eubanks earning Sportscaster of the Year honors\nThe station's role in launching careers that would shape Idaho media\n\nPart XV: Economic Impact and Business Model\nAdvertising Evolution\n\nFrom early sponsors like Lloyd Lumber Company in the 1940s Idaho Press to modern digital advertising packages, KFXD has adapted its business model to changing economic conditions.\n\nMarket Position\nThe station's multiple format changes reflect the economic challenges of operating an AM station with severe nighttime signal limitations. Each format change represented an attempt to find a sustainable niche in an increasingly competitive market.\n\nConsolidation Effects\nThe progression from independent ownership through Clear Channel to Townsquare Media reflects the broader consolidation of the radio industry. Today's KFXD operates as part of a cluster of stations sharing facilities, staff, and resources.\n\nPart XVI: Technical Specifications and Engineering\nFrequency History\n\n1925-1927: 1460 kHz (Logan, Utah)\n1927-1930: 1470 kHz (Jerome, Idaho)\n1930-2002: 580 kHz (as original KFXD)\n2002-present: 630 kHz (after call sign swap)\n\nPower and Coverage\n\nDaytime: 5,000 watts non-directional\nNighttime: 37 watts (severely restricted)\nFM Translator: K288HG at 105.5 FM\n\nTransmitter Sites\n\nOriginal Nampa site (1930-1946)\nAmity Road, Meridian (1946-present for AM)\nVarious sites for FM translator\n\nPart XVII: The Future of KFXD\nChallenges Ahead\nKFXD faces the same challenges confronting all AM radio stations:\n\nDeclining AM radio listenership\nCompetition from streaming services\nAutomotive manufacturers eliminating AM radios\nTechnical limitations of the AM band\n\nOpportunities\nDespite challenges, KFXD retains valuable assets:\n\nHeritage call letters with century-long history\nFM translator providing viable signal\nPart of Townsquare Media's digital ecosystem\nEstablished brand in the Treasure Valley\n\nPreservation of History\nThe transformation of the original KFXD building into a broadcasting museum ensures that regardless of the station's future format changes, its historical significance will be preserved and celebrated.\n\nConclusion\nKFXD-AM's century-long journey from experimental station in Utah to rhythmic contemporary format in Idaho encompasses virtually every chapter of American broadcasting history. The station pioneered radio in Idaho, attempted television when the medium was new, survived format changes that would have killed weaker operations, and adapted to digital disruption that has claimed many heritage stations.\nThe complexity of KFXD's story—with its call sign swaps, format changes, ownership transitions, and technical challenges—mirrors the broader evolution of American radio. From Frank Hurt's purchase in 1926 to today's \"Power 105.5\" brand, KFXD has continuously reinvented itself while maintaining its fundamental mission of serving the Treasure Valley.\nThe station's failed television experiment in 1953, lasting just 55 days, demonstrated both the pioneering spirit and practical limitations that have characterized KFXD throughout its history. That the station was Idaho's first television broadcaster, yet failed where others succeeded, encapsulates the risk-taking that has defined KFXD's century of broadcasting.\nToday's KFXD bears little resemblance to the station that aired Mrs. Fred Rosene's performance in 1930 or broke \"Indian Reservation\" in 1971. Yet the continuity of the call letters, the preservation of the original building, and the memories of generations of Idaho listeners ensure that KFXD's legacy transcends any particular format or ownership.\nAs AM radio faces an uncertain future, KFXD's story reminds us that broadcasting history is not just about technology or business models, but about community connection, cultural impact, and the human voices that have informed, entertained, and united listeners across decades of dramatic change.\n\nWhether KFXD continues as a rhythmic contemporary station, evolves into yet another format, or eventually goes silent, its first century has secured its place as one of Idaho's most important and enduring media institutions. The call letters that began their journey in Logan, Utah in 1925 have become synonymous with Idaho broadcasting history, a testament to the enduring power of local radio to adapt, survive, and serve its community through a century of technological and cultural transformation",
  "logo": "",
  "website": "",
  "facebook": "",
  "twitter": "",
  "instagram": "",
  "stationName": "KFXD - Super 58"
}