{
  "callLetters": "KJOT",
  "frequency": "105.1 FM",
  "location": "Boise, Idaho",
  "format": "Adult Hits (Jack FM)",
  "stationName": "Jack FM",
  "established": "1979",
  "synopsis": "KJOT 105.1 FM \"Jack FM\" represents one of Boise radio's most format-fluid stations, having transformed from country (1979) to rock (J-105, 1985-2017) to its current adult hits format under Lotus Communications ownership.",
  "fullContent": "KJOT 105.1 FM, currently branded as \"Jack FM,\" represents one of Boise radio's most format-fluid stations, having undergone numerous transformations since its 1979 launch while maintaining its position as a significant voice in the market. Owned by Lotus Communications and operating from studios on Fairview Avenue in Boise, the station currently carries an adult hits format that plays \"a wide variety of hits from the 1960s until today, concentrating mostly on rock songs from the 1980s and 1990s.\" With an effective radiated power of 52,000 watts transmitted from Horseshoe Bend, Jack FM employs the tagline \"Playing What We Want,\" which reflects the format's eclectic, DJ-less approach to music programming.\n\nThe station's journey from its origins as a country music station to its current incarnation as an adult hits destination illustrates the dynamic nature of radio programming and the station's ability to adapt to changing market conditions. Under Lotus Communications' ownership since 2018, KJOT has found stability in the Jack FM format while competing directly with KSRV-FM's \"Bob FM 96.1,\" creating an interesting adult hits rivalry in the Treasure Valley market.\n\nSTATION HISTORY\n\nEarly Years and Country Format (1979-1985)\nKJOT 105.1 FM first signed on the air in 1979 as a country music station, entering the Boise radio market during a period of significant growth in FM radio listenership. The station's launch coincided with the broader national trend of FM stations gaining popularity over their AM counterparts, as listeners increasingly preferred the superior sound quality and stereo capability that FM broadcasting offered.\n\nDuring its early years as a country station, KJOT operated in a relatively competitive landscape, as country music was already well-established in the Boise market. The station's programming likely featured the popular country artists of the late 1970s and early 1980s, including artists like Dolly Parton, Kenny Rogers, Willie Nelson, and Waylon Jennings, as well as emerging stars of the era.\n\nThe Birth of J-105 and Album-Oriented Rock (1985-2009)\nIn 1985, KJOT underwent a format change that would define its identity for the next quarter-century. The station switched from country music to an Album-Oriented Rock (AOR) format, branding itself as \"J-105.\" This transition was particularly significant because it occurred just as KLTB (104.3 FM) was abandoning its AOR format to become an adult contemporary station, leaving Boise temporarily without a dedicated rock station. KJOT's quick adoption of the AOR format filled this crucial gap, demonstrating the station's ability to respond to market needs.\n\nThe J-105 brand became synonymous with rock music in Boise, featuring deep album cuts, classic rock favorites, and newer rock releases. The Album-Oriented Rock format was designed to appeal to serious rock music fans who wanted to hear complete albums and lesser-known tracks from their favorite artists, rather than just hit singles. This approach helped J-105 build a loyal following among rock enthusiasts in the Treasure Valley.\n\nThe station's AOR format evolved over the decades, adapting to changing musical trends while maintaining its core rock identity. During the 1990s, J-105 likely incorporated grunge, alternative rock, and other emerging rock subgenres, helping to introduce Boise listeners to bands like Nirvana, Pearl Jam, and Soundgarden alongside classic rock staples.\n\nFormat Transitions and Experimentation (2010-2017)\nThe station's format stability came to an end in 2010 when KJOT began a period of experimentation with different programming approaches. At midnight on May 14, 2010, the station transitioned from its long-running classic rock format to mainstream rock, rebranding as \"Variety Rock 105.1.\" This change represented an attempt to modernize the station's sound while maintaining its rock identity.\n\nThe \"Variety Rock\" format proved to be transitional, as the station continued to search for the optimal programming approach. On November 12, 2012, KJOT began a period of \"stunting\" with Christmas music, a common radio industry practice used to generate attention before launching a new format. However, after the holiday season ended, the station returned to classic rock while retaining the \"Variety Rock\" branding, suggesting that management was still refining its programming strategy.\n\nCorporate Changes and Ownership Transitions (2014-2018)\nDuring this period of format experimentation, KJOT was also experiencing significant ownership changes. The station was owned by Journal Communications, which announced on July 30, 2014, that it would merge with the E.W. Scripps Company to create a new broadcast company under the Scripps name. This transaction was completed in 2015, bringing KJOT under the Scripps corporate umbrella.\n\nOn March 27, 2017, in what appeared to be a nostalgic gesture, KJOT returned to its beloved \"J105\" branding, suggesting that the station was acknowledging its heritage and the strong brand recognition built over decades of rock programming. This branding change indicated that the station was attempting to reconnect with its historical identity while maintaining its contemporary rock format.\n\nHowever, this return to the J105 brand would prove to be short-lived. In January 2018, Scripps announced its intention to divest its entire radio division, planning to sell all of its radio stations to focus on its television and digital media properties. This announcement set in motion the events that would lead to KJOT's next ownership change.\n\nLotus Communications Acquisition (2018)\nIn August 2018, Lotus Communications announced that it would acquire Scripps' Boise and Tucson radio clusters for  million. This acquisition included four Boise stations: KJOT (105.1 FM), KQXR (100.3 FM), KRVB (94.9 FM), and KTHI (107.1 FM). The transaction was completed in December 2018, with Scripps closing on its final sale of eight radio stations in both markets.\n\nLotus Communications, founded in 1962 and headquartered in Los Angeles, is one of the largest privately held radio station groups in the United States. The company's acquisition of the Scripps stations brought its total to 40 stations across four states, adding to its existing portfolio of 34 radio stations in Arizona, California, and Nevada.\n\nThe Jack FM Era (2018-Present)\nUnder Lotus Communications' ownership, KJOT underwent another format change, this time adopting the \"Jack FM\" adult hits format. The Jack FM brand is a syndicated format that operates across the United States and Canada, with stations in major markets including Los Angeles, Dallas, and Vancouver. The format is characterized by its eclectic mix of music spanning several decades, typically from the 1960s to the present, with a particular emphasis on rock songs from the 1980s and 1990s.\n\nThe Jack FM format represents a departure from traditional radio programming in several ways. Most notably, it typically operates without live disc jockeys, instead relying on pre-recorded voice-overs and automated playlist systems. The format's slogan, \"Playing What We Want,\" reflects this approach, suggesting that the station is not bound by traditional radio conventions or listener requests.\n\nPROGRAMMING PHILOSOPHY AND FORMAT CHARACTERISTICS\n\nThe Adult Hits Format\nThe adult hits format, as exemplified by Jack FM, targets listeners typically aged 25-54 who grew up with the music of the 1980s and 1990s but also appreciate both older and newer material. The format's broad musical scope allows it to include everything from classic rock and new wave to alternative rock and pop hits, creating a diverse listening experience that appeals to adults who may have outgrown Top 40 radio but still want to hear familiar favorites.\n\nJack FM's programming typically includes artists and songs that were popular during the target demographic's formative years, such as Def Leppard, Duran Duran, Guns N' Roses, Nirvana, Pearl Jam, and many others. The format also incorporates classic rock staples from the 1960s and 1970s, as well as selected contemporary rock and pop songs that fit the overall aesthetic.\n\nCompetition with Bob FM\nOne of the most interesting aspects of KJOT's current format is its direct competition with KSRV-FM's \"Bob FM 96.1,\" which operates a similar adult hits format. Both stations target the same demographic and play overlapping music, creating a unique competitive dynamic in the Boise market. This competition has led both stations to differentiate themselves through music selection, imaging, and promotional activities.\n\nThe presence of two adult hits stations in the same market reflects the format's popularity and the size of the target demographic in the Boise area. It also demonstrates the challenge facing radio programmers in finding distinct niches within similar formats.\n\nListener Response and Market Reception\nThe transition to Jack FM has generated mixed reactions from longtime listeners, as evidenced by online comments and reviews. Some listeners appreciate the format's variety and the nostalgic appeal of hearing favorite songs from their youth. Others, particularly those who were loyal to the J-105 rock format, have expressed disappointment with the change, feeling that the station has lost its rock identity.\n\nComments from listeners reveal the emotional connection that many had with the J-105 brand and format. Some longtime listeners have noted that they miss the \"real J-105\" and the dedicated rock programming that characterized the station for decades. This response illustrates the challenges that radio stations face when making format changes, particularly when they have built strong brand loyalty over extended periods.\n\nTECHNICAL OPERATIONS AND FACILITIES\n\nBroadcasting Infrastructure\nKJOT operates with an effective radiated power (ERP) of 52,000 watts, providing strong coverage throughout the Boise metropolitan area and extending into surrounding communities. The station's transmitter is located in Horseshoe Bend, Idaho, positioned among the towers that serve other Boise-area FM and television stations. This location provides optimal coverage for the Treasure Valley region.\n\nThe station's studios and offices are located on Fairview Avenue in Boise, which has become a hub for several radio operations in the market. This facility houses the equipment and personnel necessary for the station's day-to-day operations, including production facilities for commercials and promotional materials.\n\nCorporate Structure and Management\nUnder Lotus Communications' ownership, KJOT operates as part of a larger corporate structure that includes 40 radio stations across four states. Lotus Communications, led by President Jim Kalmenson, emphasizes local community service and programming that serves the western region markets where the company operates.\n\nThe company's approach to radio ownership combines corporate efficiency with local market focus, allowing individual stations to maintain their community connections while benefiting from corporate resources and expertise. This structure has proven successful for Lotus Communications, which has grown to become one of the largest privately held radio groups in the United States.\n\nTechnical Specifications and Contact Information\nThe station operates on 105.1 MHz FM with call letters KJOT. The business phone number is 208-344-3511, with fax services available at 208-336-3264. The station's website is located at jackboise.com, providing online streaming and information about programming and promotions.\n\nThe station is licensed to Lotus Boise Corp., reflecting the corporate structure used by Lotus Communications to manage its individual radio properties while maintaining compliance with Federal Communications Commission regulations.\n\nCOMMUNITY ENGAGEMENT AND CULTURAL IMPACT\n\nLocal Community Involvement\nAs part of Lotus Communications' commitment to serving local communities, KJOT participates in various community events and initiatives throughout the Treasure Valley. The station's involvement in local activities helps maintain its connection to the community while promoting its brand and programming.\n\nThe station's promotional activities often include sponsorship of local events, concert promotions, and community partnerships that align with the interests of its target demographic. These activities help the station maintain visibility and relevance in the local market while supporting community organizations and events.\n\nCultural Legacy and the J-105 Brand\nThe J-105 brand maintains significant cultural resonance in Boise, having served as the market's primary rock station for over two decades. The brand's legacy is reflected in its memorable appearance in the 1988 comedy film \"Moving,\" where the station was briefly heard when the Pear family arrived in Boise, providing a snapshot of the station's cultural presence during its classic rock era.\n\nThe transition away from the J-105 brand represents the end of an era for many Boise rock music fans, who viewed the station as an important part of the local music scene. The emotional response to this change demonstrates the powerful connection that radio stations can build with their audiences over extended periods.\n\nCURRENT MARKET POSITION AND FUTURE OUTLOOK\n\nCompetitive Landscape\nKJOT currently operates in a competitive radio market that includes various formats and ownership groups. The station's adult hits format positions it against other stations targeting similar demographics, including its primary competitor, Bob FM 96.1. This competition has intensified the need for effective programming and marketing strategies to differentiate the station and maintain listener loyalty.\n\nThe presence of two adult hits stations in the market suggests that there is sufficient audience demand for the format, but it also means that both stations must work harder to establish distinct identities and maintain market share.\n\nDigital Adaptation and Streaming\nLike many contemporary radio stations, KJOT has embraced digital platforms and online streaming to reach listeners beyond its traditional broadcast coverage area. The station's website provides streaming capability, allowing listeners to access programming through computers and mobile devices.\n\nThis digital presence is increasingly important as listening habits evolve and younger demographics consume more audio content through internet-connected devices. The station's ability to adapt to these changing consumption patterns will be crucial for its long-term success.\n\nFuture Prospects\nUnder Lotus Communications' ownership, KJOT appears to have found stability in the Jack FM format, though the station's history suggests that format changes remain possible if market conditions warrant them. The station's success will likely depend on its ability to maintain relevance with its target demographic while adapting to changing listener preferences and technological developments.\n\nThe station's strong technical facilities, experienced ownership group, and established market presence provide a foundation for continued success, regardless of potential future format adjustments. The adult hits format's broad appeal and the strength of the Jack FM brand suggest that the station is well-positioned to serve its target audience for the foreseeable future."
}