{
  "id": "klkix",
  "name": "KLIX",
  "frequency": "1310 AM/96.5 FM",
  "location": "Twin Falls, ID",
  "format": "Various",
  "established": "1946",
  "synopsis": "KLIX 1310 AM and KLIX-FM 96.5 MHz form a critical component of the media landscape serving the Twin Falls, Idaho, area, commonly known as the Magic Valley. The KLIX brand boasts a history stretching back nearly eight decades, characterized by early multimedia integration, strong local market dominance, and adaptation through several major corporate ownership cycles.",
  "fullProfile": "",
  "fullContent": "Historical Report on KLIX 1310 AM and KLIX-FM 96.5 MHz, Twin Falls, Idaho\n\nI. Executive Summary and Current Profile\n\nKLIX 1310 AM and KLIX-FM 96.5 MHz form a critical component of the media landscape serving the Twin Falls, Idaho, area, commonly known as the Magic Valley. The KLIX brand boasts a history stretching back nearly eight decades, characterized by early multimedia integration, strong local market dominance, and adaptation through several major corporate ownership cycles.\n\nCurrent Identity and Ownership\n\nKLIX 1310 AM currently broadcasts a news/talk format branded as \"News Radio 1310 KLIX\" [1]. Its sister station, KLIX-FM 96.5 MHz, airs a classic hits format under the name \"Kool 96.5\" [2]. Both stations are owned by Townsquare Media, operating through the licensee Townsquare License, LLC [1]. They are clustered with other regional stations, including KEZJ-FM and KSNQ [1].\n\nTechnical Specifications\n\nThe primary AM facility operates on 1310 kHz. It is classified as a Class B station with a substantial power output of 5,000 watts during the daytime, reduced to 2,500 watts at night to comply with directional requirements and interference prevention [1]. KLIX AM programming is augmented by an FM translator, K241DD, operating at 96.1 FM in Twin Falls, providing improved signal quality and easier access for listeners who prefer the FM band [1, 3].\n\nKLIX-FM on 96.5 MHz is a powerful Class C1 facility, licensed for 100,000 watts Effective Radiated Power (ERP) [2]. This high-power signal ensures wide regional coverage for its classic hits format. The KLIX call letters themselves are historic, dating back to 1946, and the station’s skywave signal has been noted for distant reception in locations such as Salt Lake City, Utah, and Bonners Ferry, Idaho, underscoring its historical importance in regional broadcasting [1].\n\nII. Foundational History and Multimedia Expansion (1946–1970)\n\nInitial Launch and Market Position\nKLIX 1310 AM first signed on the air on December 11, 1946 [1]. At the time of its establishment, Twin Falls, a town of approximately 17,000 residents, saw KLIX become only the third radio station authorized for the Magic Valley, signifying its pioneering role in developing local media infrastructure [4]. Early local figures, such as Dean Eacker, were associated with the station, helping to establish its initial community presence [5].\n\nPioneering Multimedia Ownership\nIn 1955, the station’s owners, led by President Frank C. Carman, demonstrated exceptional forward thinking by expanding into the nascent television market. Carman announced that the company would launch a television station alongside KLIX radio, leading to the sign-on of KLIX-TV (Channel 7) on June 1, 1955 [4]. This move established KLIX as an early integrated media entity in Idaho, owning both radio and television properties, a structure that mirrored the growth of major media conglomerates decades later. The original studios were located at the corner of Eastland Drive and Elizabeth Boulevard in Twin Falls, serving as the hub for this burgeoning media operation until 1986 [4].\n\nEarly FM History\nWhile the core KLIX history centered on the AM facility, the current KLIX-FM license on 96.5 MHz began its history in 1974 under the call sign KMTW. This FM facility would later be integrated into the KLIX brand identity, eventually adopting the KLIX-FM call letters in 1986 [2].\n\nIII. The Tuma Era and Format Specialization (1973–1990s)\n\nA pivotal period in the station's history occurred in 1973 when Charles \"Charlie\" Tuma purchased KLIX [6]. Tuma immediately implemented a major strategic shift, changing the format to Country music [6]. This era is recognized for establishing KLIX as the dominant radio force in Southern Idaho.\n\nLocal Dominance through Information Focus\n\nTuma's success was not merely dependent on the popular Country music format, but on the crucial integration of strong local news and community presence, which gave the station a \"big city sound\" and allowed it to \"absolutely dominate Southern Idaho radio\" [6]. This emphasis on local informational content ensured that KLIX served as a vital community resource, building deep listener trust and market loyalty beyond its music genre. The determination to be the market’s primary information source, established during this period, laid the groundwork for the station's eventual successful pivot to its current News/Talk format, even after the specific music genre changed.\n\nKey Talent and Branding\n\nThe dominance of this era was supported by a team of notable on-air personalities, including Dave Winter, Johnny Mac, Carl Raida, Bobby Dobbs, Dennis Conrad, Don Jeb, and Doug Van [6]. The station was famously branded as \"The Sound of the Valley.\"\n\nTo leverage the AM station's immense brand equity, the separately licensed FM facility operating on 96.5 MHz was rebranded to KLIX-FM in 1986 [2], aligning the high-power music station with the well-known KLIX identity.\n\nIV. Corporate Consolidation and Modern Ownership (1990s–Present)\n\nThe Consolidation Cycle\nIn the late 1990s and early 2000s, KLIX and KLIX-FM licenses became part of Clear Channel Communications (the precursor to iHeartMedia) as radio ownership rules were relaxed, leading to widespread national corporate consolidation.\n\nTransition to Townsquare Media\nThe station licenses were eventually divested by Clear Channel. In October 2007, KLIX and KLIX-FM were acquired by GAP Broadcasting II LLC, a transaction that involved 57 stations nationwide and was reported at a total sale price of $74.78 million [1, 2]. This divestiture signaled a return to somewhat more localized or regionally focused management than the Clear Channel era had often provided.\n\nThe current ownership structure was established on August 13, 2010, when GAP Broadcasting II, which had evolved into GapWest Broadcasting, was integrated into Townsquare Media [1]. Townsquare Media has since maintained ownership of the KLIX cluster, ensuring stability and corporate resources for the market.\n\nV. Current Operations, Formats, and Strategic Clustering\nTownsquare Media utilizes the dual assets of the KLIX brand to capture two distinct and profitable demographics within the Twin Falls market.\n\nKLIX AM: News and Information Hub\nKLIX 1310 AM, now \"News Radio 1310 KLIX,\" fulfills the mission of market information dominance established by Charlie Tuma decades earlier. The AM signal, supplemented by the 96.1 FM translator, relies on high-engagement programming, featuring syndicated national hosts alongside local content provided by personalities such as Rick Hughes and others [3]. The programming mix includes affiliations with Fox News Radio, Premiere Networks, and Westwood One, delivering essential news, political commentary, and advice programming, including The Dave Ramsey Show [1, 3].\n\nKLIX-FM: Classic Hits Revenue Driver\nThe high-power 96.5 MHz frequency is dedicated to music revenue, operating as \"Kool 96.5\" with a Classic Hits format, affiliated with Compass Media Networks [2]. This music format appeals to an established adult demographic, complementing the talk programming on the AM frequency and allowing Townsquare Media to maximize market reach across different listening preferences.\n\nThe strategic deployment of the powerful physical assets demonstrates a calculated market control strategy. The history of KLIX shows that the station’s long-term success has relied on providing critical information to the Magic Valley, first by embedding strong local news within a popular music format (Country), and subsequently by transitioning the AM frequency entirely to the dedicated News/Talk format, the most economically efficient modern vehicle for information delivery. By anchoring this content on the most recognized frequency via an FM translator, the station protects its brand heritage and audience share against the challenges facing the AM band.\n\nA summary of key ownership and format transitions for the KLIX brand is provided below.\n\nTable Title: KLIX (AM/FM) Ownership and Format Timeline\n\nDate (Approximate)\tEvent Type\tStation/Call Sign\tOwner/Licensee\tKey Format/Status\nDec 11, 1946\tAM Sign-On\tKLIX 1310 AM\t(Original Licensee) [1]\tGeneral/Early Local [4]\n1973\tAM Sale & Format Change\tKLIX 1310 AM\tCharles Tuma [6]\tDominant Country/Local News\n1974\tFM Sign-On\tKMTW 96.5 FM\t(Unknown) [2]\tOriginal FM frequency license\nOct 2007\tAcquisition\tKLIX AM/FM\tGAP Broadcasting II LLC [1]\tDivestiture from Clear Channel\nAug 2010\tAcquisition\tKLIX AM/FM\tTownsquare Media [1]\tCurrent Ownership\nPresent\tFormat\tKLIX 1310 AM\tTownsquare Media [1]\tNews/Talk (Affiliations: Fox News Radio, etc.)\nPresent\tFormat\tKLIX-FM 96.5 MHz\tTownsquare Media [2]\tClassic Hits (\"Kool 96.5\")\nVI. Conclusion: Legacy and Market Strategy\nKLIX 1310 AM holds a significant place in Idaho broadcasting history, recognized as the third station licensed in Twin Falls and a pioneer of integrated media ownership with the launch of KLIX-TV in 1955 [4]. The subsequent Tuma era cemented its reputation not just as an entertainment provider but as the central news source for Southern Idaho [6].\n\nUnder Townsquare Media, the KLIX brand is strategically deployed across two frequencies to maximize profitability and listener engagement. The 1310 AM license, coupled with its FM translator, maintains the station’s crucial role as a news and political discussion platform, effectively utilizing syndicated talk programming to keep operational costs manageable while serving an information-hungry audience. Meanwhile, the high-power 96.5 FM frequency ensures the KLIX brand dominates the music market with its popular Classic Hits format. This calculated dual-format strategy, leveraging the strength of the combined AM/FM assets, positions Townsquare Media to effectively navigate the ongoing challenges of digital disruption in the Twin Falls radio market.",
  "logo": "",
  "website": "",
  "facebook": "",
  "twitter": "",
  "instagram": "",
  "stationName": "KLIX"
}